Ran Plan for 2 projects:

1. project: `cvm` dir: `cvm` workspace: `default`
1. project: `clb` dir: `clb` workspace: `default`
---

### 1. project: `cvm` dir: `cvm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa5e655d9ed2af54090e2e285ed8f702b4_NpVH8YZIP6wD8AQyEr21Q3PNGpDNWEsQ4hHYBHQsRw7oCD_a8xk2b8ExSWJV0qYGgXSyWVSAnQ71E-C4EIVNxnvCGSnKEzFntBSn6ZBK9W5HafUiMS7dVnrvNIL_BcwPmjqcjtzhWIOW-otUVpzJ-h2_-8jhK986JwE0l9GwdWpB97C6rgr3gSPQPc8jqx-LdDYttHeAeu2dUd4dCf9v0be0GkyWdY52XMnrTQrraxeM0OKMBe6zmsgwheYakmKfXYYNvoa72eJhX0m1c3WaECNQQjTWDsx_FU4xM-UYhPBn5jAm5KQR2pvTb8EfJZUWpe71JRXx8fZ2f18oiQMuhaVoNST-ZRpy8jVMuqBOpHT2xK5Ek_ETtRZr6uvoHz0GJZ7Y1AOOGF20LZcKRA-e2WzHMEAiyKTfgMgDlBZBf0
TmpSecretId=AKIDOZUhYZXXgJ3nLkPwe9Wk3NRlk132kI87RJokAzGD8mE9Ww4OOPI2zOHmK2SjH3HF
TmpSecretKey=qddekMtoMos5xBBfJiUxfhwfcI6DnQ5kzBdaXF2Ck1o=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDOZUhYZXXgJ3nLkPwe9Wk3NRlk132kI87RJokAzGD8mE9Ww4OOPI2zOHmK2SjH3HF
TENCENTCLOUD_SECRET_KEY=qddekMtoMos5xBBfJiUxfhwfcI6DnQ5kzBdaXF2Ck1o=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa5e655d9ed2af54090e2e285ed8f702b4_NpVH8YZIP6wD8AQyEr21Q3PNGpDNWEsQ4hHYBHQsRw7oCD_a8xk2b8ExSWJV0qYGgXSyWVSAnQ71E-C4EIVNxnvCGSnKEzFntBSn6ZBK9W5HafUiMS7dVnrvNIL_BcwPmjqcjtzhWIOW-otUVpzJ-h2_-8jhK986JwE0l9GwdWpB97C6rgr3gSPQPc8jqx-LdDYttHeAeu2dUd4dCf9v0be0GkyWdY52XMnrTQrraxeM0OKMBe6zmsgwheYakmKfXYYNvoa72eJhX0m1c3WaECNQQjTWDsx_FU4xM-UYhPBn5jAm5KQR2pvTb8EfJZUWpe71JRXx8fZ2f18oiQMuhaVoNST-ZRpy8jVMuqBOpHT2xK5Ek_ETtRZr6uvoHz0GJZ7Y1AOOGF20LZcKRA-e2WzHMEAiyKTfgMgDlBZBf0
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOac5e47fc719edeb0d8e14b5f6ce74d359_NpVH8YZIP6wD8AQyEr21Yb73s6YpIQsoPwWmfOs3r7bR78qnxb4nNg9efn7vxMi0bFn3BEWe7Y8dCpLwfIEBCcI8FXSwv9wpQkA7oKm9ZorWmBLzIBmvtm1FfEIkskSWmPlCmsrLvKB1tHr1PpIYdz0Fo1TlYwRIrwx8OpQadPVc3i_AS2jlM1fIFbQEDn_PAagvAEPfBoqODkq8w55hAUkuIUIJYo-yG-tt_wu_4cGvnVbUbbxRbGYq0veHVZYKnaqg0hQ4tNevLHnc-hsi9Xh1UMXTKILS7v7IOM4iLRXGYJfuSQbmmFlYNzKy5z64DB6NZAJ8vCOvFPAY33qSfm7NjIzVfU8g7JNHyf-dF1a6nX4ppbArflPSQnFY1LSRf7kzDjVYiBp-mcqAerQg2-lNDvQO4_HD31S9goieV0
TmpSecretId=AKIDh61abYZaUQ1YsZ2avNjLjuNPCNkpwDfjruDts34z8A56Ryw5ukJke9S00X5MtvAB
TmpSecretKey=xjejMMBDnKeemOcRqVEBjHD7qQObsMsRlKdzOQoNNJ0=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDh61abYZaUQ1YsZ2avNjLjuNPCNkpwDfjruDts34z8A56Ryw5ukJke9S00X5MtvAB
TENCENTCLOUD_SECRET_KEY=xjejMMBDnKeemOcRqVEBjHD7qQObsMsRlKdzOQoNNJ0=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOac5e47fc719edeb0d8e14b5f6ce74d359_NpVH8YZIP6wD8AQyEr21Yb73s6YpIQsoPwWmfOs3r7bR78qnxb4nNg9efn7vxMi0bFn3BEWe7Y8dCpLwfIEBCcI8FXSwv9wpQkA7oKm9ZorWmBLzIBmvtm1FfEIkskSWmPlCmsrLvKB1tHr1PpIYdz0Fo1TlYwRIrwx8OpQadPVc3i_AS2jlM1fIFbQEDn_PAagvAEPfBoqODkq8w55hAUkuIUIJYo-yG-tt_wu_4cGvnVbUbbxRbGYq0veHVZYKnaqg0hQ4tNevLHnc-hsi9Xh1UMXTKILS7v7IOM4iLRXGYJfuSQbmmFlYNzKy5z64DB6NZAJ8vCOvFPAY33qSfm7NjIzVfU8g7JNHyf-dF1a6nX4ppbArflPSQnFY1LSRf7kzDjVYiBp-mcqAerQg2-lNDvQO4_HD31S9goieV0

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.cvm_cicd_kk_1 will be created
  + resource "tencentcloud_instance" "cvm_cicd_kk_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + hostname                                = "user"
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cvm_cicd_kk_1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 50
          + data_disk_type         = "CLOUD_PREMIUM"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 0
        }
    }

  # tencentcloud_subnet.cicd_kk will be created
  + resource "tencentcloud_subnet" "cicd_kk" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd_kk_subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_kk will be created
  + resource "tencentcloud_vpc" "cicd_kk" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd_kk_vpc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cvm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fcvm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cvm
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `clb` dir: `clb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa07d97276cc4c922b2af53a8cdd8a065c_NpVH8YZIP6wD8AQyEr21a3Ec3X8H6TmPsQ8hvO0upkjAJupbxBA-z1he51g2m3-7Pid4Eit9S58JzLDurfmoljY3UA8kqIOzGVSSqKPk6Jz7Yh4xLoisOqajG0-MUhBwOXQOXmAz6NIl2xbgCr5tFJ-RKEUdxQrK_ncxjeuxRhYckN8n3I4V5UKVBAP-Q1Lzo0CcRHpWNtR5WRsgD5CtKwPNfx3AZcjDX1EW39_fEI3T2kdJziT1P704inqKkGZw_CE_5k6dBBedTfVD9C_2VUCnLfJWixtPTJKnr4lvDR3600RDXQx4SZudggTz8itUqWLi8bElJPy3BKxjBmGzgrMkKjaNy1WIw1WhN7AHyXs-wKaVNMyHgcoVyDuok5t1t6B76jQK_Zq5ZtjzcsE8TYmu0bUQ9Si-CGU1dX4La0
TmpSecretId=AKID_DKdtmUUao7z-sHvI9yV6YTuKG0tyLAMKAmKAsIA2C_Azi518XUH16NZ_MMefxVM
TmpSecretKey=xhXs+3UnilR623JeOBWBBnXWmACNoePpLhfspE1hjTs=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKID_DKdtmUUao7z-sHvI9yV6YTuKG0tyLAMKAmKAsIA2C_Azi518XUH16NZ_MMefxVM
TENCENTCLOUD_SECRET_KEY=xhXs+3UnilR623JeOBWBBnXWmACNoePpLhfspE1hjTs=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa07d97276cc4c922b2af53a8cdd8a065c_NpVH8YZIP6wD8AQyEr21a3Ec3X8H6TmPsQ8hvO0upkjAJupbxBA-z1he51g2m3-7Pid4Eit9S58JzLDurfmoljY3UA8kqIOzGVSSqKPk6Jz7Yh4xLoisOqajG0-MUhBwOXQOXmAz6NIl2xbgCr5tFJ-RKEUdxQrK_ncxjeuxRhYckN8n3I4V5UKVBAP-Q1Lzo0CcRHpWNtR5WRsgD5CtKwPNfx3AZcjDX1EW39_fEI3T2kdJziT1P704inqKkGZw_CE_5k6dBBedTfVD9C_2VUCnLfJWixtPTJKnr4lvDR3600RDXQx4SZudggTz8itUqWLi8bElJPy3BKxjBmGzgrMkKjaNy1WIw1WhN7AHyXs-wKaVNMyHgcoVyDuok5t1t6B76jQK_Zq5ZtjzcsE8TYmu0bUQ9Si-CGU1dX4La0
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOaa4780a2e7ec172c68df9ca4a27f1d7e5_NpVH8YZIP6wD8AQyEr21f3Uup7swHukelBB488f2no_B-lPcoj2xglzuXXDL1l80gxMsbswG3bwliHp0OpQJJJdNetfwd7225vKD8aZ7B3_oAiYoL9b2IsJcBHsQBdm7L71hnCZyCsh7qqNY-vIMoDM4UhQLoZoNjtlF3OvKZfJE-kAwMT_xMi6LB5PnhXVjBnCmRqmFZr-keF-iF9oomCCxj7E86I2rYmKp2HX-j6w8_oIB5OglNyJ8OLWtaEeU0NrNYa2YeosrjoECGagzzmbf0DHKc3h90UDG8HyxtN4KVbOVZ9bcCjL575y95-lLCF9FWs859gpP9EM011ch0_yYMeA_-CRMxLkbjMs5BK8m40qsEoqjCT0gzLpKBtfygE8KYTb4VmQ6l3axGHooipXXO2z5ajhf6zSyE2i6KM
TmpSecretId=AKIDKGq-n7XzgZ4xkNEY6ol0tT7NpVeoqY1dPByMa3NsEnDoy_Zg_GTngbGjBz2lWULx
TmpSecretKey=FHbcCo0JO14OnYPULGvLxasG2PTss2evF6c3fY2tdMI=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDKGq-n7XzgZ4xkNEY6ol0tT7NpVeoqY1dPByMa3NsEnDoy_Zg_GTngbGjBz2lWULx
TENCENTCLOUD_SECRET_KEY=FHbcCo0JO14OnYPULGvLxasG2PTss2evF6c3fY2tdMI=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOaa4780a2e7ec172c68df9ca4a27f1d7e5_NpVH8YZIP6wD8AQyEr21f3Uup7swHukelBB488f2no_B-lPcoj2xglzuXXDL1l80gxMsbswG3bwliHp0OpQJJJdNetfwd7225vKD8aZ7B3_oAiYoL9b2IsJcBHsQBdm7L71hnCZyCsh7qqNY-vIMoDM4UhQLoZoNjtlF3OvKZfJE-kAwMT_xMi6LB5PnhXVjBnCmRqmFZr-keF-iF9oomCCxj7E86I2rYmKp2HX-j6w8_oIB5OglNyJ8OLWtaEeU0NrNYa2YeosrjoECGagzzmbf0DHKc3h90UDG8HyxtN4KVbOVZ9bcCjL575y95-lLCF9FWs859gpP9EM011ch0_yYMeA_-CRMxLkbjMs5BK8m40qsEoqjCT0gzLpKBtfygE8KYTb4VmQ6l3axGHooipXXO2z5ajhf6zSyE2i6KM

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + master_zone_id               = (known after apply)
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + slave_zone_id                = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
      + zone_id                      = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p clb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fclb%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p clb
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```